Revit 2027 API
TableCellStyle.FontHorizontalAlignment Property
 The horizontal alignment style of text font.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HorizontalAlignmentStyle FontHorizontalAlignment { get; set; }
Public Property FontHorizontalAlignment As HorizontalAlignmentStyle
	Get
	Set
public:
property HorizontalAlignmentStyle FontHorizontalAlignment {
	HorizontalAlignmentStyle get ();
	void set (HorizontalAlignmentStyle value);
}
member FontHorizontalAlignment : HorizontalAlignmentStyle with get, set
Property Value
HorizontalAlignmentStyle
 Alignment style.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
TableCellStyle Class
Autodesk.Revit.DB Namespace